

class DataList{
  static const List<String> ingredients = [
    'Спагетти',
    'Сұйық май',
    'Қызанақ',
    'Жұмыртқа',
    'Бидай ұны',
    'Сарымсақ',
    'Тұз',
    'Сәбіз',
    'Ақтүйнек',
  ];

  static const List<Category> categories = [
    Category(
      picture: 'assets/images/6.jpeg', 
      title: 'Салаттар'
    ),
    Category(
      picture: 'assets/images/breakfast.jpeg', 
      title: 'Таңғы ас'
    ),
    Category(
      picture: 'assets/images/8.jpeg', 
      title: 'Негізгі тағамдар'
    ),
    Category(
      picture: 'assets/images/11.jpeg', 
      title: 'Тағамдар'
    ),
  ];
  
  static List<Recipe> recipes = [
    Recipe(
      category: categories[0], 
      description: 'Спагетти карбонара - тағам итальяндық болса да, ол бүкіл әлемде, соның ішінде мұнда өте танымал. Бір кездері қарапайым кеншілер ойлап тапқан бұл қарапайым және қанағаттанарлық макарон көптеген адамдардың жүрегі мен асқазанын жаулап алды. Карбонара үшін ет көп және майы аз бекон кесектерін таңдау керек. Егер ол көп болса, онда ол пісіру кезінде еріген кезде макарон тым ауыр болады. Сарымсақты ұсақтап, қуыруға болады. Бірақ тағам нәзік, нәзік хош иіске ие болу үшін сарымсақтың кесектерін майға қайнатып, бірнеше минуттан кейін табадан алып тастау жеткілікті. Карбонара рецептінде спагеттиді пайдаланудың қажеті жоқ - макаронның барлық түрлерінің 500 түрінен сүйікті макаронды таңдаңыз. Бірақ тек қатты бидайдан.', 
      ingredients: [
        'Спагетти:250 г',
        'Сұйық май:20 г',
        'Сарымсақ:2 дана',
        'Тұз:дәміне қарай',
      ], 
      picture: 'assets/images/2.jpeg', 
      steps: [
        'Үлкен кастрюльде суды қайнатыңыз және макаронды аль-дентеге дейін пісіріңіз. Әдетте мұны істеу үшін оны қаптамада көрсетілгеннен бір минутқа аз пісіру керек.',
        'Макарон пісіріліп жатқанда, сары майды қуыруға арналған табада ерітіп, майдалап туралған пиязды, сарымсақ пен беконды қуырыңыз. Жұмсақ және айқын сарымсақ пен қуырылған беконның иісі шыққанша.',
        'Табаны оттан алып, терең ыдысқа салып, төрт жұмыртқаның сарысын кілегеймен және үгітілген пармезанмен шайқаңыз. Қоспаға тұз бен бұрыш қосып, қайтадан шайқаңыз.'
      ], 
      title: 'Кремі бар спагетти карбонара'
    ),
    Recipe(
      category: categories[0], 
      description: 'Стейкке тамаша қосымша болуы мүмкін. Шие қызанағын қызанақ ретінде қолданған дұрыс. Біріншіден, олар тығыздығына байланысты қуыруға жақсы төзеді, екіншіден, қыста біздің ауданда тек шие қызанақтары шынымен қызанақ дәміне ие.', 
      ingredients: [
        'Қызанақ:400 г',
        'Тұз:дәміне қарай',
        'Сарымсақ:1 дана',
      ], 
      picture: 'assets/images/5.jpeg', 
      steps: [
        'Орташа қызанақтарды қалыңдығы бір сантиметрдей сақиналарға кесіңіз. Қуыруға арналған табаны қыздырып, аздап зәйтүн майын қосып, қызанақ тілімдерін қытырлақ болғанша қуырыңыз, содан кейін оттан алыңыз.',
        'Табиғи йогуртты 50 мл зәйтүн майымен араластырыңыз. Сарымсақ түйірін пышақпен ұсақтап, оны талшықтарға бөліп, майдалап тураңыз. Дәміне қарай сары май, тұз және бұрыш қосылған йогуртқа туралған сарымсақты қосыңыз.',
        'Алынған тұздықты салат жапырақтарының қоспасына қосыңыз, қуырылған қызанақтардың сақиналарымен безендіріңіз және олар сәл суыған кезде қызмет етіңіз - немесе әлі ыстық болса, бұл дәм мәселесі.',
      ], 
      title: 'Қуырылған қызанақ қосылған салат'
    ),
    Recipe(
      category: categories[0], 
      description: 'Асшаяндар мен күнжіт қосылған салат қарапайым және қысқа, өйткені бұл теңіз өнімдері қажетсіз сүйемелдеуді қажет етпейді. Салаттағы майонезді табиғи йогуртпен немесе лимон шырыны қосылған зәйтүн майымен ауыстыруға болады. Ал тағамды ірі туралған авокадо мен үгітілген пармезанмен толықтырыңыз. Асшаяндарды өздері үш жолмен дайындауға болады: қайнатылған, пісірілген немесе қуырылған. Ең бастысы, мұны ұзақ уақыт бойы жасамау. Осы процедуралардың әрқайсысымен асшаянның дәмі әртүрлі өзгереді, бірақ бұл оны тартымды етпейді.', 
      ingredients: [
        'Қызанақ:400 г',
        'Тұз:дәміне қарай',
        'Сарымсақ:2 дана',
      ], 
      picture: 'assets/images/6.jpeg', 
      steps: [
        'Үлкен кастрюльде суды қайнатыңыз және макаронды аль-дентеге дейін пісіріңіз. Әдетте мұны істеу үшін оны қаптамада көрсетілгеннен бір минутқа аз пісіру керек.',
        'Макарон пісіріліп жатқанда, сары майды қуыруға арналған табада ерітіп, майдалап туралған пиязды, сарымсақ пен беконды қуырыңыз. Жұмсақ және айқын сарымсақ пен қуырылған беконның иісі шыққанша.',
        'Табаны оттан алып, терең ыдысқа салып, төрт жұмыртқаның сарысын кілегеймен және үгітілген пармезанмен шайқаңыз. Қоспаға тұз бен бұрыш қосып, қайтадан шайқаңыз.'
      ], 
      title: 'Асшаяндар мен күнжіт тұқымдары бар салат'
    ),











    //2
    Recipe(
      category: categories[1], 
      description: 'Жалқау тұшпара - бұл бірдей тұшпара, тек тәтті және соло түрінде. Оларды дайындау кез келген ботқаға қарағанда көп уақытты қажет етпейді және кез келген ботқалардан айырмашылығы, олардың сыртқы түрімен таңертең сізді ренжітпейді. Оларды сүйікті джеммен, үйдегі мармеладпен, қаймақпен немесе кез келген сироппен ұсынуға болады. Немесе оған жай ғана еріген сары майды құюға болады - ол бәрібір дәмді болады.', 
      ingredients: [
        'Тауық жұмыртқасы: 1 дана',
        'Жұмсақ сүзбе: 200 г',
        'Бидай ұны: 30 г',
        'Қант: дәміне қарай',
        'Тұз: дәміне қарай',
      ], 
      picture: 'assets/images/2.jpeg', 
      steps: [
        'Кең ыдысқа сүзбе салып, жұмыртқаны, қантты және ұнды қосып, тегіс болғанша шанышқымен араластырыңыз. Егер масса тым жабысқақ болса, көбірек ұн қосыңыз, бірақ жарты ас қасықтан артық емес.',
        'Дастарханға аздаған ұн себіңіз де, сүзбе массасын жайыңыз. Екі тең бөлікке бөліп, әрқайсысын бірдей қалыңдықтағы шұжықтарға айналдырыңыз.',
        'Шұжықтарды бірдей ұсақ кесектерге кесу үшін өткір пышақты пайдаланыңыз. Қаласаңыз, әр бөлікті сәл тегістеуге және оған дөңгелек пішін беруге болады.',
      ], 
      title: 'Жалқауларға арналған таңғы ас'
    ),

    Recipe(
      category: categories[1], 
      description: 'Қазірдің өзінде дәмді қарақұмық хош иісті шөптердің компаниясында кездеседі: кинза, ақжелкен және балдыркөк. Рецептте айтылған зәйтүн майы дәмді болуы керек - кем дегенде extra virgin.', 
      ingredients: [
        'Лимон: 1/5 дана',
        'Зәйтүн майы: 2 ас қасық',
        'Соя соусы: дәміне қарай',
      ], 
      picture: 'assets/images/4.jpeg', 
      steps: [
        'Қарақұмықты шайыңыз, 2 стакан қайнаған су құйыңыз, тұз қосыңыз, қақпақпен жабыңыз және сүлгімен жабыңыз. 45-60 минуттан кейін қарақұмық жеуге дайын болады, ол тағамдық құндылығын жоғалтпайды. Мұны түнде жасаған дұрыс.',
        'Зәйтүн майы, соя соусы, лимон шырыны немесе туралған лимон және туралған шөптер қосылған үстелге буға пісірілген қарақұмықтың қажетті мөлшерін қосыңыз, араластырыңыз.',
        'Болгар бұрышы, сәбіз, асқабақ, редис және жасыл смузи сияқты туралған көкөністермен бірге қызмет етіңіз.',
      ], 
      title: 'Қарақұмық таңғы ас'
    ),

    Recipe(
      category: categories[1], 
      description: '', 
      ingredients: [
        'Сәбіз: 1 дана',
        'Алма: 1 дана',
        'Жиіз: 1 дана',
        'Бал: 1 дана',
      ], 
      picture: 'assets/images/3.jpeg', 
      steps: [
        'Сәбіз мен жасыл алманы орташа үккіште үккіштен өткізіңіз.',
        'Апельсиннің қабығын алып тастаңыз. 1 жартысынан шырынды сығыңыз, екіншісін кішкене кесектерге кесіңіз.',
        'Алма, сәбіз, апельсин, мейіз және жаңғақтарды (кез келген, сүйікті), шырын мен балмен дәмдеңіз, даршын қосыңыз.',
      ], 
      title: 'Балалық шақтағы таңғы ас'
    ),


















    Recipe(
      category: categories[2], 
      description: 'Азу татарша. Кеңестік азық-түлік дәстүрінде жеке кесіммен сатылу құрметіне ие болған бірнеше тағамдардың бірі. Ал гастрономдар мен супермаркеттерде әлі күнге дейін белдеулерге кесіліп, азу ретінде сатылатын сиыр етін табуға болады. Тағамның өзі, оны қалай және немен дайындау керектігі туралы әлі де пікірталастар бар: сиыр немесе қой етін, май немесе кәдімгі сары майды қолданыңыз, қазанда немесе қалың түбі бар кастрюльде қайнатыңыз. Бұл тағамның көптеген басылымдары болуы мүмкін, бірақ оның негізі әрқашан бірдей - ол жолақтарға, картопқа және томат соусына кесілген.', 
      ingredients: [
        'Сиыр еті: 500 г',
        'Сарымсақ: 3 дана',
        'Картоп: 1 кг',
      ], 
      picture: 'assets/images/7.jpeg', 
      steps: [
        'Үлкен кастрюльде суды қайнатыңыз және макаронды аль-дентеге дейін пісіріңіз. Әдетте мұны істеу үшін оны қаптамада көрсетілгеннен бір минутқа аз пісіру керек.',
        'Макарон пісіріліп жатқанда, сары майды қуыруға арналған табада ерітіп, майдалап туралған пиязды, сарымсақ пен беконды қуырыңыз. Жұмсақ және айқын сарымсақ пен қуырылған беконның иісі шыққанша.',
        'Табаны оттан алып, терең ыдысқа салып, төрт жұмыртқаның сарысын кілегеймен және үгітілген пармезанмен шайқаңыз. Қоспаға тұз бен бұрыш қосып, қайтадан шайқаңыз.'
      ], 
      title: 'Азу татарша'
    ),
    Recipe(
      category: categories[2], 
      description: 'Кеңестік азық-түлік дәстүрінде жеке кесіммен сатылу құрметіне ие болған бірнеше тағамдардың бірі. Ал гастрономдар мен супермаркеттерде әлі күнге дейін белдеулерге кесіліп, азу ретінде сатылатын сиыр етін табуға болады. Тағамның өзі, оны қалай және немен дайындау керектігі туралы әлі де пікірталастар бар: сиыр немесе қой етін, май немесе кәдімгі сары майды қолданыңыз, қазанда немесе қалың түбі бар кастрюльде қайнатыңыз. Бұл тағамның көптеген басылымдары болуы мүмкін, бірақ оның негізі әрқашан бірдей - ол жолақтарға, картопқа және томат соусына кесілген.', 
      ingredients: [
        'Тауық еті: 300 г',
        'Сарымсақ: 4 дана',
        'Картоп: 2 кг',
      ], 
      picture: 'assets/images/8.jpeg', 
      steps: [
        'Үлкен кастрюльде суды қайнатыңыз және макаронды аль-дентеге дейін пісіріңіз. Әдетте мұны істеу үшін оны қаптамада көрсетілгеннен бір минутқа аз пісіру керек.',
        'Макарон пісіріліп жатқанда, сары майды қуыруға арналған табада ерітіп, майдалап туралған пиязды, сарымсақ пен беконды қуырыңыз. Жұмсақ және айқын сарымсақ пен қуырылған беконның иісі шыққанша.',
        'Табаны оттан алып, терең ыдысқа салып, төрт жұмыртқаның сарысын кілегеймен және үгітілген пармезанмен шайқаңыз. Қоспаға тұз бен бұрыш қосып, қайтадан шайқаңыз.'
      ], 
      title: '«Пикассо» тауық еті'
    ),
    Recipe(
      category: categories[2], 
      description: 'Әлемдік аспаздықтағы ең керемет гарнирлердің бірі және картопты пайдаланудың ең тиімді жолы. Ингредиенттер қарапайым: картоп, ірімшік және қалың кілегей, оларды қаймақ немесе майонез сияқты өнімдермен алмастыруға болмайды. Жақсы дайындалған картоп гратині (немесе француз тілінде гратин) тіпті гарнир ретінде ұсынылатын негізгі тағамнан да асып түседі. Мұндағы трюк кремді шамадан тыс толтырмау болып табылады, әйтпесе гратин тым майлы және тамырлы болады, бірақ сіз оны қоса алмайсыз, содан кейін ол керемет гратин емес, жай ғана қабыршақты кастрюль болады.', 
      ingredients: [
        'Сиыр еті: 400 г',
        'Сарымсақ: 2 дана',
        'Картоп: 1 кг',
      ], 
      picture: 'assets/images/9.jpeg', 
      steps: [
        'Үлкен кастрюльде суды қайнатыңыз және макаронды аль-дентеге дейін пісіріңіз. Әдетте мұны істеу үшін оны қаптамада көрсетілгеннен бір минутқа аз пісіру керек.',
        'Макарон пісіріліп жатқанда, сары майды қуыруға арналған табада ерітіп, майдалап туралған пиязды, сарымсақ пен беконды қуырыңыз. Жұмсақ және айқын сарымсақ пен қуырылған беконның иісі шыққанша.',
        'Табаны оттан алып, терең ыдысқа салып, төрт жұмыртқаның сарысын кілегеймен және үгітілген пармезанмен шайқаңыз. Қоспаға тұз бен бұрыш қосып, қайтадан шайқаңыз.'
      ], 
      title: 'Гратен дофинуа'
    ),






    Recipe(
      category: categories[3], 
      description: 'Зімбір сусыны', 
      ingredients: [
        'Лимон: 1 дана»',
        'Қайнаған су: 1 стакан',
        'Бал: 1 қасық»'
      ], 
      picture: 'assets/images/10.jpeg', 
      steps: [
        'Жаңа зімбір тамырын 10 жұқа тілімдерге кесіңіз. Үлкен стаканға салып, 1 тілім жаңа лимон қосыңыз. Сондай-ақ дәміне қарай анис немесе даршын қосуға болады. Қайнаған суды құйып, жабыңыз, шамамен 10-15 минут күтіңіз.',
        'Осыдан кейін дәміне қарай бал қосыңыз (балды бірден қоспағаныңыз жөн, өйткені ол 60 градустан жоғары температурада өзінің барлық пайдалы қасиеттерін жоғалтады). Қақпағы бар шыныаяқты немесе термосты пайдалануға болады.',
      ], 
      title: 'Зімбір сусыны'
    ),
    Recipe(
      category: categories[3], 
      description: 'Жидек сусыны', 
      ingredients: [
        'Жидектер: 1 дана»',
        'Қайнаған су: 1 стакан',
        'Бал: 1 қасық»'
      ], 
      picture: 'assets/images/11.jpeg', 
      steps: [
        'Жаңа зімбір тамырын 10 жұқа тілімдерге кесіңіз. Үлкен стаканға салып, 1 тілім жаңа лимон қосыңыз. Сондай-ақ дәміне қарай анис немесе даршын қосуға болады. Қайнаған суды құйып, жабыңыз, шамамен 10-15 минут күтіңіз.',
        'Осыдан кейін дәміне қарай бал қосыңыз (балды бірден қоспағаныңыз жөн, өйткені ол 60 градустан жоғары температурада өзінің барлық пайдалы қасиеттерін жоғалтады). Қақпағы бар шыныаяқты немесе термосты пайдалануға болады.',
      ], 
      title: 'Жидек сусыны'
    ),
    Recipe(
      category: categories[3], 
      description: 'Кокос сусыны', 
      ingredients: [
        'Кокос:1 штука',
        'Кипяток:1 стакан',
        'Мед:1 ложка',
      ], 
      picture: 'assets/images/12.jpeg', 
      steps: [
        'Жаңа зімбір тамырын 10 жұқа тілімдерге кесіңіз. Үлкен стаканға салып, 1 тілім жаңа лимон қосыңыз. Сондай-ақ дәміне қарай анис немесе даршын қосуға болады. Қайнаған суды құйып, жабыңыз, шамамен 10-15 минут күтіңіз.',
        'Осыдан кейін дәміне қарай бал қосыңыз (балды бірден қоспағаныңыз жөн, өйткені ол 60 градустан жоғары температурада өзінің барлық пайдалы қасиеттерін жоғалтады). Қақпағы бар шыныаяқты немесе термосты пайдалануға болады.'
      ], 
      title: 'Кокос сусыны'
    ),
  ];
  







  static List<Illness> illnesses = [
    Illness(
      title: 'Қант диабеті',
      description: 'Диабет (лат. diabetes mellitus) — бұл қанда қант мөлшерінің көбейіп кетуінен пайда болатын дерт. Бұл аурумен жас та, кемел жастағылар да, кәрі де ауырады. Әсіресе жасөспірім кездегі диабет ауруы өте қиын, мұндай жаста диабетпен ауырғандарға арнаулы дәрі (инсулин) қолдану ұсынылады.', 
      causes: [
        'иммунитеттің нашарлауы',
        'метаболикалық бұзылыс',
        'генетикалық бейімділік',
        'жүрек-қан тамырлары аурулары',
        'кортикостероидтарды қолдану',
      ], 
      symptoms: [
        'үнемі сусап тұру (полидипсия)',
        'кіші дәреттің жиілеп, көп болуы (полиурия)',
        'үнемі шаршаулы сезіну (полифагия)',
        'қол-аяқтың үйып, жансыздануы',
        'үнемі қарын аштығынан арылмау',
        'салмақ азаюы ',
      ], 
      solves: [
        'Диета қант диабетін емдеудің қажетті бөлігі болып табылады, өйткені онсыз көмірсулар алмасуының орнын толтыру мүмкін емес.',
        'Гликемиялық деңгейлердің өзін-өзі бақылауы қант диабетін емдеудің тағы бір маңызды сәті болып табылады, көмірсулар алмасуының тиімді ұзақ мерзімді өтелуіне мүмкіндік береді. Ол әдетте глюкометрлер арқылы жасалады.',
        'Инсулиндік терапия. Инсулинмен емдеу 1 типті қант диабеті бар адамдар үшін өте маңызды және кейде 2 типті қант диабеті бар адамдарға да берілуі мүмкін. Енгізілетін инсулиннің дозасы тәулік уақытына, сондай-ақ қант диабетімен ауыратын науқастардың тамақ мөлшеріне байланысты.',
        'Антигипергликемиялық препараттар диетамен бірге тағайындалады және ішекте қанттың (глюкозаның) сіңуін азайту функциясына ие.',
      ], 
      picture: 'assets/images/diabet.png', 
    ),
    

    Illness(
      title: 'Анорексия',
      description: 'Анорексия - ағзаның тағамдық орталығы қызметінің бұзылуы салдарынан тамақтануға физиологиялық қажеттілік бола тұра тәбеттің болмауы', 
      causes: [
        'Отбасы. Анорексия диагнозы қойылған науқастардың шамамен 42% жағдайда отбасылық қарым-қатынастар жанжалдың жоғары деңгейімен сипатталды немесе ата-анасының біреуі маскүнемдіктен зардап шекті',
        'Биологиялық. Семіздік пен ерте етеккір бар адамдарда гормоналды дисфункция',
        'Мәдени. Бала кезінен салмағы мен сыртқы келбеті туралы алаңдаушылық тудырған қазіргі заманғы арық сәні әйелдер мен қыздардың қатаң диеталарға жүгінуіне әкеледі.',
        'Стресстік. Анорексияның дамуының қоздырғышы кез келген стресстік жағдай болуы мүмкін',
        'Әлеуметтік. Әлеуметтік бейімделудегі қиындықтар, мектепте мазақ ету немесе нашар қарым-қатынас тәжірибесі анорексияның дамуына себеп болуы мүмкін',
      ], 
      symptoms: [
        'салмақ жетіспеушілігі визуалды түрде анықталады',
        'депрессия мен тітіркену байқалады, олар эйфориямен ауыстырылады',
        'негізсіз реніш немесе ашулану өзін көрсетеді',
        'ұйқы проблемалары бар',
        'тырнақтардың, шаштың және терінің жағдайы күрт нашарлайды',
      ], 
      solves: [
        'психиатриялық',
        'дәрілік',
        'физиотерапиялық',
      ], 
      picture: 'assets/images/anoreksia.jpg', 
    ),


    Illness(
      title: 'Семіздік',
      description: 'Семіздік (Ожирение қазақша). Семіздік — май тіні есебінен дене салмағының артық ұлғаюын шақыратын зат алмасудың бұзылысы.', 
      causes: [
        'Біріншілік семіздік (экзогендік-конституциялық) – оның себептері артық тамақтану және энергия тұтынудың төмендеуі – семіздіктің ең таралған түрі (шамамен 90%).',
        'Екіншілік (симптоматикалық) – ауруларға байланысты салмақ қосу.',
      ], 
      symptoms: [
        'Тіпті шамалы физикалық күш салу кезінде пайда болатын тыныс алудың қысқа болуы.',
        'Майлы фигура - толық иық, жамбас, үлкен іш.',
        'Терлеудің жоғарылауы.',
        'Буындардың ауыруы, аяқтың ісінуі.',
      ], 
      solves: [
        'Алиментарлық семіздікті диетолог емдейді: ол емдік физиотерапия маманымен бірге диетаны жасайды',
        'Психогенді семіздікті емдеуге психологтар мен психотерапевтер қатысады',
        'Симптоматикалық семіздік диета немесе жаттығулар арқылы ғана түзетілуі мүмкін - негізгі аурумен күресу',
        'III-IV дәрежелі семіздік үшін бариатриялық хирургия (асқазан резекциясы немесе асқазан жолағы) қолданылады',
      ], 
      picture: 'assets/images/ozhirenie.jpg', 
    ),
  ];
}


class Recipe{
  final String title;
  final String description;
  final List<String> ingredients;
  final List<String> steps;
  final Category category;
  final String picture;


  Recipe({
    required this.category,
    required this.description,
    required this.ingredients,
    required this.picture,
    required this.steps,
    required this.title,
  });


  factory Recipe.fromJson(Map<String, dynamic> json) {
    return Recipe(
      title: json['title'],
      description: json['description'],
      ingredients: (json['ingredients'] as List).map((e) => e.toString()).toList(),
      steps: (json['steps'] as List).map((e) => e.toString()).toList(),
      category: Category.fromJson(json['category']),
      picture: json['picture'],
    );
  }



  Map<String, dynamic> toMap(){
    return {
      'title': title,
      'description': description,
      'ingredients': ingredients,
      'steps': steps,
      'category': category.toMap(),
      'picture': picture,
    };
  }
}


class Category{
  final String title;
  final String picture;
  const Category({required this.picture, required this.title});


  factory Category.fromJson(Map<String, dynamic> json) {
    return Category(
      title: json['title'],
      picture: json['picture'],
    );
  }



  Map<String, dynamic> toMap(){
    return {
      'title': title,
      'picture': picture,
    };
  }
}



class MyRecipe{
  final String title;
  final String description;
  final DateTime createdAt;


  MyRecipe({
    required this.description,
    required this.title,
    required this.createdAt,
  });


  factory MyRecipe.fromJson(Map<String, dynamic> json) {
    return MyRecipe(
      title: json['title'],
      description: json['description'],
      createdAt: DateTime.parse(json['created_at']),
    );
  }



  Map<String, dynamic> toMap(){
    return {
      'title': title,
      'description': description,
      'created_at': createdAt.toString()
    };
  }
}












class Illness{
  final String title;
  final String description;
  final List<String> causes;
  final List<String> symptoms;
  final List<String> solves;
  final String picture;


  Illness({
    required this.description,
    required this.causes,
    required this.symptoms,
    required this.solves,
    required this.picture,
    required this.title,
  });
}