class MainConfigApp {

  //Main
  static String appName = 'Bırge üirenemız';


  static String fontFamily1 = 'Roboto';



  





  static List<WordGroup> words = [
    WordGroup(
      title: 'A', 
      values: [
        'абонемент – абонемент', 'абревиатура – басқы әріп', 'абзац – азат жол', 'автобиографический очерк - өмірбаяндық очерк', 'автобиографический роман - өмірбаяндық роман', 'автобиография - өмірбаян', 'автограф – қолтаңба', 'автоматизация – автоматтандыру'
      ]
    ),
    WordGroup(
      title: 'Б', 
      values: [
        'библиотечные курсы – кітапханалық курстар', 'библиотечные услуги – кітапханалық қызмет', 'библиотечный проект – кітапханалық жоба', 'библиотечный стандарт – кітапханалық стандарт', 'библиотечный урок – кітапханалық сабақ', 'библиотечный фонд – кітапханалық қор', 'брошюра – кітапша', 'буклет – бүктеме', 'бумага – қағаз', 'бюллетень новых поступлений – жаңа түскен басылымдар бюллетені'
      ]
    ),
    WordGroup(
      title: 'В', 
      values: [
        'вакансия – бос орын', 'введение – кіріспе', 'ввод – енгізу', 'ведомость – ведомость, тізімдеме, тізім', 'ведомость учета – есеп', 'ведомость инвентаризационная – түгендеу ведомосі, тізімі', 'ведущий – жүргізуші', 'ведомственная библиотечная сеть – мекемелік кітапхана торабы', 'видеозапись – бейнежазу, бейнежазба', 'видеотекст – бейнемәтін', 'виртуальная – виртуалды', 'виртуальная справка – виртуалды анықтама', 'вирус – залал', 'внебюджетные – бюджеттен тыс', 'внедрить – енгізу, ендіру, қолдану'
      ]
    ),
    WordGroup(
      title: 'Г', 
      values: [
        'газета – газет, үнқағаз', 'газетная статья – газет мақаласы', 'генеральный каталог – бас каталог', 'герб – елтаңба', 'глава – тарау', 'глобализация – жаһандану, глобализация', 'год издания – басылып шыққан жылы', 'годовой – жылдық', 'годовой комплект – жылдық жинақ', 'годовой отчет – жылдық есеп', 'годовой план – жылдық жоспар', 'годичный – жылдық', 'городская библиотека – қалалық кітапхана'
      ]
    ),
    WordGroup(
      title: 'Д', 
      values: [
        'данные – мәліметтер, деректер', 'дар – сый тарту, сыйлық', 'движение фонда – қордың қозғалысы', 'дебат – талқылау, жарыс сөз', 'девиантное поведение – әумесерлік мінез-құлық', 'дежурство – кезекшілік', 'декларация – мәлімдеме, мәлімдеу, жарияланым, жариялау', 'дело – жұмыс, іс', 'день информации – ақпарат күні', 'день специалиста – мамандар күні', 'депозитарный фонд – депозитарлық қор', 'детская библиотека – балалар кітапханасы', 'дефектный экземпляр – ақаулық дана', 'деятель – қайраткер', 'деятельность – қызмет, іс-әрекет, іс, жігерлілік', 'динамика фонда – қордың өсімі'
      ]
    ),
    WordGroup(
      title: 'Е', 
      values: [
        'единица – бірлік, бір', 'единица учета – есеп бірлігі', 'единица учета фонда – қор есебінің өлшемі', 'единица хранения фонда – қорды сақтау бірлігі', 'единый фонд – біртұтас қор', 'ежегодник – жылнама; жылдық, әржылдық', 'ежегодно – жыл сайын', 'ежедневное издание – күнделікті басылым'
      ]
    ),
    WordGroup(
      title: 'Ж', 
      values: [
        'живопись – кескіндеме, сурет', 'жизнеописание - өмірбаян', 'жирный шрифт – қалың шрифт'
      ]
    ),
    WordGroup(
      title: 'З', 
      values: [
        'заведующий – меңгеруші', 'заведующий отдела – бөлім меңгерушісі', 'заверить – сендіру, куәландыру', 'заглавие – бас тақырып, басы, аты, тақырып', 'заголовок – басы, аты, тақырып, тақырыпша', 'заголовок предметной рубрики – пәндік айдардың тақырыбы', 'задание – тапсырма', 'задолжник – борышты'
      ]
    ),
    WordGroup(
      title: 'И', 
      values: [
        'идентификация – теңестіру, ұқсастыру', 'идентичный – ұқсас, дәлме-дәл, тең', 'иерархический метод классификации – жіктеудің иерархиялық әдісі', 'избранные сочинения – таңдамалы шығармалар', 'издание –басылым, шығару, басып шығару', 'издатель – баспагер', 'издательская продукция – баспа өнімі', 'издательство – баспа орны, баспа'
      ]
    ),
    WordGroup(
      title: 'К', 
      values: [
        'казахская литература – қазақ әдебиеті', 'календарь – күнтізбе', 'канцелярия – кеңсе', 'кармашек книги- кітап қалташасы', 'картотека – картотека', 'картотека новых поступлений – жаңа түскен басылымдар картотекасы', 'картотека отказов – қанағаттандырылмаған өтініштер картотекасы', 'картотека персоналий – жеке адамдар картотекасы', 'картотека статей – мақалалар картотекасы', 'кассета – үнтаспа', 'каталог – каталог, тізбе, тізім', 'каталогизатор – каталогтаушы', 'каталогизация – каталогтау', 'каталожный индекс – каталогтық нұсқатаңба', 'категория – категория, санат', 'кафедра выдачи – кітап беру кафедрасы', 'квалификация – біліктілік, мамандық', 'квалифицированный- маманданған, білікті, өз ісін жетік білетін', 'квалифицированный специалист – білікті маман', 'квартал – тоқсан', 'клавиатура – пернетақта (информатика)'
      ]
    ),
    WordGroup(
      title: 'Л', 
      values: [
        'легенда – аңыз', 'лекция – дәріс', 'летопись – жылнама, шежіре', 'лист – парақ, бет, табақ', 'листок – парақ', 'листок сроков возврата – қайтару мерзімі парағы', 'листовка – үндеу, үнпарақ', 'литература - әдебиет', 'литературная игра - әдеби ойын', 'литературно-художественное издание – көркем-әдеби басылым', 'литературный вечер - әдеби кеш', 'литературный комплекс - әдеби жиынтық', 'литературный суд - әдеби сот', 'лицензионный – лицензиялық', 'логика – қисын'
      ]
    ),
    WordGroup(
      title: 'М', 
      values: [
        'метод - әдіс, амал, тәсіл', 'макрокопирование – көлемді көшірмелеу', 'макрокопия – көлемі үлкен көшірме', 'массовая библиотека – көпшілік кітапхана', 'массовая литература – көпшілікке арналған кітапхана', 'массовая работа – көпшілік жұмыс', 'массовое библиографическое информирование – көпшілік библиографиялық хабарлама', 'массовое издание – көпшілік басылым', 'массовое информирование – көпшілік хабарлама', 'матричный принтер – матрицалық принтер', 'межбиблиотечный абонемент – кітапханааралық абонемент', 'межведомственная централизация – мекемеаралық орталықтандыру', 'международная конференция – халықаралық конференция', 'мемориальное издание – мемориал басылым', 'мемуары – естелік жазбалар, естеліктер', 'мероприятие – шара', 'местное издание – жергілікті басылым', 'место издания – басылым орны', 'методика - әдістеме; әдістер, әдіс-тәсілдер жиынтығы', 'методист - әдіскер'
      ]
    ),
    WordGroup(
      title: 'Н', 
      values: [
        'набор – жинақ', 'награда – марапат', 'наглядная пропаганда – көрнекті насихаттау', 'наглядное пособие – көрнекі құрал', 'надпись – жазба, жазу', 'надежность фонда – қордың дәйектілігі', 'название – ат, аты, атау', 'назначение – тағайындау, міндет, жүктеу', 'наименование – атауы, аты', 'накладная – тіркеме құжат, тауар құжаттамасы', 'накладные расходы – үстеме шығындар', 'наличие – бар болуы, қолда бары', 'направление – бағыт, бағыттау; жолдама', 'наука – ғылым'
      ]
    ),
    WordGroup(
      title: 'О', 
      values: [
        'обзор – шолу', 'областная библиотека – облыстық кітапхана', 'область выходных данных – шығу деректерінің саласы', 'область примечания – ескертулер саласы', 'обложка - мұқаба', 'обложка – тыс, мұқаба', 'обменно-резервный фонд – айырбас резерв қоры', 'обновление – жаңарту, жаңару, жаңғырту, толықтыру', 'обновление фонда – қорды жаңарту', 'обновляемость – жаңарғыштық', 'обновляемость фонда – қордың жаңарғыштығы', 'обобщающее заглавие – жинақтайтын бас тақырып', 'обобщение –қорыту, талдап қорыту, жалпы қорытынды', 'обозначение – белгі, белгілеу, көрсету', 'обозреватель – шолушы', 'оборудование – жабдық, жабдықтау, құрал-жабдық', 'обоснование – негіздеу, негіздеме, дәлелдеу', 'обработка - өңдеу'
      ]
    ),
    WordGroup(
      title: 'П', 
      values: [
        'пагинация – нөмірлеу', 'пакет – десте', 'памят – зерде', 'памятка – жаднама, жадуал', 'папка – қапшық', 'паспорт – төлқұжат'
      ]
    ),
    WordGroup(
      title: 'Р', 
      values: [
        'работа – жұмыс, қызмет', 'работа с читателями – оқырмандармен жұмыс', 'работник – жұмыскер, қызметкер', 'работодатель – жұмыс беруші', 'рабочий – жұмысшы', 'развитие – даму, дамыту, өркендеу, жетілу', 'разворот – жазылған бет', 'разговорник – тілашар'
      ]
    ),
    WordGroup(
      title: 'С', 
      values: [
        'сведение – мәлімет', 'сведения об ответственности – жауапкершілік туралы мәліметтер', 'сведения относящиеся к заглавию – бас тақырыпқа қатысты мәліметтер', 'сверхурочная работа – үстеме жұмыс', 'свиток – шиыршық қағаз', 'сводка – ақпар, мәлімет', 'сводный – жиынтық; құрама, жинақ', 'себестоимость - өзіндік құн'
      ]
    ),
    WordGroup(
      title: 'Т', 
      values: [
        'табель – тізім, тізімдік, табель', 'таблица – кесте', 'таблица классификации – жіктеу кестесі', 'табло – көрсеткіш тақта', 'талант – талант, дарын', 'творчество – шығармашылық', 'текст – мәтін'
      ]
    ),
    WordGroup(
      title: 'У', 
      values: [
        'указ – жарлық', 'указатель – көрсеткіш', 'укомплектование – жинау, толтыру', 'универсальный - әмбебап', 'универсальная библиотека - әмбебап кітапхана'
      ]
    ),
    WordGroup(
      title: 'Ф', 
      values: [
        'файл – файл', 'факт – дәлел, айғақ, дерек', 'фактический – шынында, шындығында, шын мәнісінде', 'фактографическая справка – деректі мәліметтер анықтамасы', 'фамилия – аты-жөні, тек, ата тек', 'фантастика – фантастика, қиял, таңғажайып', 'фиксация – бекіту'
      ]
    ),
    WordGroup(
      title: 'Х', 
      values: [
        'характеристика – мінездеме, сипаттама', 'хранение фонда – қорды сақтау', 'хранилище – қойма'
      ]
    ),
    WordGroup(
      title: 'Ц', 
      values: [
        'цель – нысана, мақсат', 'центр – орта, орталық', 'централизация – орталықтандыру', 'централизованная библиотечная система – орталықтанған кітапханалар жүйесі', 'централизованный – орталықтандырылған'
      ]
    ),
    WordGroup(
      title: 'Ч', 
      values: [
        'час – сағат', 'часть – бөлік, бөлім, бөлшек, мүше, тарау', 'часть издания – басылым бөлігі', 'число – сан', 'численность – сан, мөлшер', 'читаемость – оқылым', 'читальный зал – оқу залы', 'читатель – оқырман', 'читательская аудитория – оқырман аудиториясы', 'читательская группа – оқырман тобы'
      ]
    ),
    WordGroup(
      title: 'Ш', 
      values: [
        'шаблон – үлгі', 'школьная библиотека – мектеп кітапханасы', 'шрифт – қаріп'
      ]
    ),
    WordGroup(
      title: 'Э', 
      values: [
        'экземпляр – дана', 'экспресс-информация – жедел ақпарат', 'электронная почта – электронды пошта', 'электронный каталог – электрондық каталог'
      ]
    ),
    WordGroup(
      title: 'Ю', 
      values: [
        'юбилейное издание – мерейтойлық басылым', 'юношеская библиотека – жасөспірімдер кітапханасы', 'юридический – заң, заңдық'
      ]
    ),
    WordGroup(
      title: 'Я', 
      values: [
        'язык – тіл', 'ядро фонда – қор өзегі', 'языкознание – тіл білімі', 'ячейка – ұяшық'
      ]
    ),
  ];


  static List<WordGroup> idioms = [
    WordGroup(
      title: 'Отан,туған жер, ел – халық', 
      values: [
        'Ел мен жер егіз',
        'Ел іші алтын бесік',
        'Өнер көзі халықта',
        'Ақ бөкенді жатыр деме,\nКөшпелі елді отыр деме'
      ]
    ),
    WordGroup(
      title: 'Ер, ерлік, батырлық.', 
      values: [
        'Ер егіз, еңбекте жалғыз',
        'Қатты жерде қақ тұрар,\nҚайратты ерде мал тұрар\nТалапты ерге нұр жауар',
        'Ер мойнында қыл арқан шірімейді',
        'Нар тәуекел – ер ісі'
      ]
    ),
    WordGroup(
      title: 'Еңбек – байлық, кәсіп – нәсіп', 
      values: [
        'Біткен іске сыншы көп',
        'Еңбек ер атандырар',
        'Еңбек бәрінде жеңбек',
        'Еңбектің наны тәтті,\nЖалқаудың жаны тәтті'
      ]
    ),
    WordGroup(
      title: 'Адам, кісі', 
      values: [
        'Бір кісі мың кісіге олжа салар.',
        'Жақсы адам — жұрттың ырысы.',
        'Адам жүрген жермен\nАдам жүреді,\nБіреу білмегенді\nБіреу біледі.',
        'Ат аяғынан семірер,\nАдам құлағынан семірер.',
        'Екі кісі ығысса,\nБір кісілік орын бар.'
      ]
    ),
    WordGroup(
      title: 'Ата-ана, ұл мен қыз', 
      values: [
        'Анасын сүйгеннің\nБаласын сүй.',
        'Ананың көңілі балада,\nБаланың көңілі далада.',
        'Жалғыз баласы атқа шапса,\nАтасы ауылда тұрып\nТақымын қысады.',
        'Ана жақсылығын,\nАуырсаң білерсің.\nҚайын жақсылығын,\nҚыдырсаң білерсің.'
      ]
    ),
    WordGroup(
      title: 'Аға', 
      values: [
        'Аға алғанша, жеңге жегенше.',
        'Аға алдында арсыз іні сөйлейді.',
        'Аға алдында пейілінді көрсет,\nІні аддында мейірінді көрсет.',
        'Аға әдепті болса іні әдепті,\nАпа әдепті болса сіңлі әдепті.',
        'Аға болсаң ақыл айт, ақыл айтсаң мақүл айт.'
      ]
    ),
    WordGroup(
      title: 'Адамгершілік, жақсылық, қайырымдылық, мейірімділік', 
      values: [
        'Адам бір-біріне қонақ.',
        'Ат жақсысын мақта,Адам жақсысын жақта.',
        'Адам қайғысы - заман қайғысы.',
        'Күйесіз қазан жоқ,\nҚайғысыз адам жоқ.',
        'Жасық адам жасына жетпей қартаяр,\nАсыл адам жасына жетпей марқаяр.'
      ]
    ),
    WordGroup(
      title: 'Байлық, кедейлік туралы', 
      values: [
        'Тар киім – тозғақ.',
        'Кедей мен бай жолдас болмас,\nҚасқыр мен қой жолдас болмас.',
        'Алтынды тот баспайды.',
        'Аузы қисық болса да, байдың ұлы сөйлесін.',
        'Қарыз қатынас бұзады.',
        'Тіленшіге жел қарсы.'
      ]
    ),
  ];






  static List<TestQuestion> tests = [
    TestQuestion(
      question: 'Рет - ретімен, белгілі тәртіппен орналасқан әріптер жиынтығы', 
      trueIndex: 3, 
      values: [
        'сөз',
        'сөйлем',
        'сөз тіркесі',
        'әліпби немесе алфавит'
      ]
    ),
    TestQuestion(
      question: 'Алфавитте 3 - ші орналасқан әріп', 
      trueIndex: 1, 
      values: [
        'ә',
        'б',
        'в',
        'я'
      ]
    ),
    TestQuestion(
      question: 'Қатаң дауыссыз дыбыстары бар сөз', 
      trueIndex: 3, 
      values: [
        'бор',
        'құлақ',
        'қасық',
        'шаң'
      ]
    ),
    TestQuestion(
      question: 'Үндестік заңына бағынбай тұрған сөз', 
      trueIndex: 3, 
      values: [
        'емхана',
        'асхана',
        'аспаз',
        'емші'
      ]
    ),
  ];
   
}



class WordGroup{
  final String title;
  final List<String> values;

  WordGroup({required this.title, required this.values});
}


class TestQuestion{
  final String question;
  final List<String> values;
  final int trueIndex;

  TestQuestion({required this.question, required this.trueIndex, required this.values });
}
// «Bırge üirenemız” мобильді қосымшасын дайындау:
// Бастапқы деректер:
//   •Қазақ тіліндегі әліпбиден бастап үйрету
//   •Сөздер жаттау
//   •Қызықты тапсырмалар мен ойындардан өту
//   •Түрлі жаңылтпаштар және мақал-мәтелдер 
// Оңай әрі қызықты түрде қазақ тілін бірге үйренеміз.